// ============================================================================
// HelloConsole.cpp: Консольное приложение с доп. окошками – шаблон.
//
// 2019. Вариант 1.
// If you can't see comments in Russian on Git, download and see its locally.
// (Solved.)
// ============================================================================

#include "HelloConsole.h"
// ----------------------------------------------------------------------------
#define LOGENABLED true
#include "WinWnd.h"

// ============================================================================
const float Version = 0.01f;


// ============================================================================
exception Exc; // До этого места полагается уже определить GetUnexpected;
               // Где-нибудь в какой-нибудь далекой _SystemInit...


// ============================================================================
const char * const SetLocale(void);


// ============================================================================
template<typename T> class testclass
{

};


// ============================================================================
int main(int argc, char argv[]) // Можно что-нибудь перетянуть на ярлычок
{                               // на рабочем столе и посмотреть argv[1].
    Println("Локаль:", SetLocale()) << endl; // Маленькая шалость.
#ifdef _DEBUG
    Println("Отладочная сборка:", Version);
#else
    Println("Без отладки:", Version);
#endif
    Println("Разрядность системы (бит):", _INTEGRAL_MAX_BITS);
#ifdef WIN32
    Println("Разрядность сборки (бит):", 32);	// TODO: Поаккуратнее.
#else
    Println("Разрядность сборки (бит):", 64);
#endif

    cout << endl;

    //-------------------------------------------------------------------------
    // Цилиндрическая часть котла — коническая. Хи-хи.
    // (Ну, так-то образована из телескопически сопряжённых цилиндрических
    // барабанов.)
    while (true)
    {
        Sleep(5000);
        break;
    }



    return 0;
}


// ============================================================================
const char * const SetLocale(void)
{
    ios_base::sync_with_stdio(false);
    return setlocale(LC_ALL, "rus");
}


// ============================================================================

